//
//  main.swift
//  Study
//
//  Created by 강태윤 on 2020/12/08.
//

import Foundation
import SwiftUI

//MARK: - 입력과 사칙연산
//num1000()         //clear 2020.12.08
//num2557()         //clear 2020.12.08  //upload 2020.12.15
//num10718()        //clear 2020.12.08  //upload 2020.12.15
//num10171()        //clear 2020.12.08  //upload 2020.12.16
//num10172()        //clear 2020.12.08  //upload 2020.12.17
//num1001()         //clear 2020.12.08
//num10998()        //clear 2020.12.08
//num1008()         //clear 2020.12.08
//num10869()        //clear 2020.12.08
//num10430()        //clear 2020.12.08
//num2588()         //clear 2020.12.08

//MARK: - if
//num1330()         //clear 2020.12.09
//num9498()         //clear 2020.12.09
//num2753()         //clear 2020.12.09
//num14681()        //clear 2020.12.09
//num2884()         //clear 2020.12.09 * 내 코드 작성, 실행 잘만 되는데 왜 틀렸다는건지 이해 불가/ 다른 사람의 코드 사용

//MARK: - for
//num2739()         //claer 2020.12.09
//num10950()        //clear 2020.12.09
//num8393()         //clear 2020.12.09
//num15552()        //clear 2020.12.09 * 내 코드 작성, 속도가 느림 방법 이해 불가/ 다른 사람의 코드 사용
//num2741()         //clear 2020.12.09
//num2742()         //clear 2020.12.09
//num11021()        //clear 2020.12.09
//num11022()        //clear 2020.12.09
//num2438()         //clear 2020.12.09
//num2439()         //clear 2020.12.09 * 내 코드 작성, for 문 사용법 숙지가 미숙함/ 다른 사람의 코드 힌트
//num10871()        //clear 2020.12.09

//MARK: - while
//num10952()        //clear 2020.12.10
//num10951()        //clear 2020.12.10
//num1110()         //clear 2020.12.10 * 내 코드 작성, while 문 사용법 숙지가 미숙함/ 다른 사람의 코드 사용

//MARK: - 1차원 배열
//num10818()        //clear 2020.12.10 * 내 코드 작성, Bubble정렬 사용법 숙지가 미숙함/ 다른 사람의 코드 사용/ 단순하게 생각하기.
//num2562()         //clear 2020.12.10
//num2577()         //clear 2020.12.10 * 내 코드 작성, 실행 잘만 되는데 왜 틀렸다는건지 이해 불가/ 다른 사람의 코드 사용/ 단순하게 생각하기.
//num3052()         //clear 2020.12.10 * 내 코드 작성, 값 다 받아놓고 마지막 중복검사를 못함/ Set 사용법을 잘 알아두자 편리함.
//num1546()         //clear 2020.12.10 * 배열.max()는 되도록 사용하지 말자 입력된 값 중 최대값을 잘 못찾는 것 같다. 그냥 서로 비교해가면서 최대값 찾을 것.
//num8958()         //clear 2020.12.11 * 내 코드 작성, 절반정도만 / 입력까지는 구현, 배열 활용 및 개념에 대해 이해가 부족한 듯/ 단순하게 생각하기.
//num4344()         //clear 2020.12.11 * 내 코드 작성, 실행 잘만 되는데 왜 틀렸다는건지 이해 불가/ 다른 사람의 코드 사용/ map 사용법 익히기/ 단순하게 생각하기.

//MARK: - 함수
//num15596(a:10)    //clear 2020.12.12 * Swift용 코드 작성/ 문제 제출이 Swift로 불가하여 C 언어로 작성/ 다른 사람의 코드 사용/ 난수생성 팁
    //임의의 정수 n개가 주어졌을 때, n개의 합을 구하는 함수.
//num4673()         //clear 2020.12.14 * 내 코드 작성, 실행 잘만 되는데 왜 틀렸다는건지 이해 불가/ 다른 사람의 코드 사용/ 에라토스테네스의 체 공부하기/ 단순하게 생각하기.
//num1065()         //clear 2020.12.14 

//MARK: - 문자열
//num11654()        //clear 2020.12.14
//num11720()        //clear 2020.12.16
//num10809()        //clear 2020.12.16 * 내 코드 작성, 실행 결과 같은데 막혀서 질문올림, 조건식 잘못 작성.. 알고 보니 상단부 조건식도 잘못 작성.. 꼼꼼히 확인하기 ^^
//num2675()         //clear 2020.12.16
//num1157()         //clear 2020.12.16
//num1152()         //clear 2020.12.18
//num2908()         //clear 2020.12.18
//num5622()         //clear 2020.12.18 숫자에 해당하는 영어가 도저히 이해가 안가서 다른사람 코드 참고/ 쉽지만 불친절한 문제
num2941()

//MARK: - 오답노트
/*
     num2884()
     num15552()
     num2439()
     num1110()
     num10818()
     num2577()
     num3052()
     num8958()
     num4344()
 */
